In [1]:
import mysql.connector as cn

In [4]:
try:
    d1=cn.connect(host='localhost',database='db1',user='root',passwd='tikeswari')
    print(d1.is_connected())
    crs=d1.cursor()
    
    n=int(input('enter number of query :'))
    for i in range(n):
        q=input('enter the query:')
        crs.execute(q)
        d1.commit()
        print(crs.fetchall())
except Exception as e:
    d1.close()
    print(str(e))

True
enter number of query :5
enter the query:CREATE TABLE Employee(Emp_id int(10),Name varchar(20),Email varchar(25), PhoneNo int(20),Salary int(10))
[]
enter the query:insert into Employee values(101,'tiki','t123@gmail.com',9938,10000)
[]
enter the query:insert into Employee values(102,'riki','r23@gmail.com',7938,7000)
[]
enter the query:insert into Employee values(103,'sudh','su3@gmail.com',8988,1800)
[]
enter the query:insert into Employee values(104,'tiki','tiki@gmail.com',7978,15000)
[]

In [5]:
import pandas as pd
import csv

In [8]:
data=pd.read_sql('select Emp_id,PhoneNo,Salary from Employee',d1)

C:\Users\lenovo\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [10]:
data.to_csv('emp_data.csv')

In [11]:
dt=pd.read_csv('emp_data.csv')

In [12]:
dt

   Unnamed: 0  Emp_id  PhoneNo  Salary
0           0     101     9938   10000
1           1     102     7938    7000
2           2     103     8988    1800
3           3     104     7978   15000

In [13]:
crs.execute('create table emp_csv(id int(10),ph int(20),sal int(20))')

In [17]:
#inserting data from a csv file to a table
with open('emp_data.csv','r') as emp:
    next(emp)
    d_csv=csv.reader(emp,delimiter='\n')
    for i in enumerate(d_csv):
        crs.execute('insert into emp_csv values({})'.format(i[1][0]))
    print('data inserted')
d1.commit()

data inserted

#### Homework

In [55]:
import mysql.connector as conn
import csv

In [56]:
try:
    d2=conn.connect(host='localhost',database='tiku',user='root',passwd='tikeswari')
    print(d2.is_connected())
    crs=d2.cursor()
except Exception as e:
    d2.commit()
    print(str(e))

True

In [57]:
crs.execute('create table carbon4(a int(20),b int(20),c int(20),d int(20),e int(20),f int(20),g int(20),h int(20),i int(20),j int(20),k int(20),l int(20),m int(20),n int(20))')

In [58]:
'''with open('carbon_nanotubes.csv','r') as carb:
    next(carb)
    c=csv.reader(carb,delimiter='\n')
    for i in c:
        p=i[0]
        #print(p)
        x=p.replace(';',',')
        r=x.split(',')
        #print(x)
        q="insert into carbon2 values("+x+")"
        crs.execute(q)
        d2.commit()
    print('data inserted-->')
d2.close()'''
with open('carbon_nanotubes.csv','r') as f:
    next(f)
    data=csv.reader(f,delimiter='\n')
    for i in data:
        j=i[0]
        j=j.replace(';',',')
        k=j.split(',')
        if k[13]=='':
            k[13]='-1'
            l=','.join(k)
            qry="insert into carbon4 values("+l+")"
            crs.execute(qry)
            d2.commit()
        else:
            qry="insert into carbon4 values("+j+")"
            crs.execute(qry)
            d2.commit()            
print('all data inserted')
d2.close()

all data inserted

In [59]:
d2.close()

In [51]:
i

['7;3;0,235578;0,615865;0,795605;0,232297;0,617997;1']

In [52]:
j

'7,3,0,235578,0,615865,0,795605,0,232297,0,617997,1'

In [53]:
k

['7',
 '3',
 '0',
 '235578',
 '0',
 '615865',
 '0',
 '795605',
 '0',
 '232297',
 '0',
 '617997',
 '1']

In [54]:
l

NameError: name 'l' is not defined